{
    "wildflowers": [
      {
        "lenapeName": "pèkòn",
        "lenapeMeaning": "red dye",
        "lenapeTalkingDict": "https://talk-lenape.org/detail?id=8395",
        "englishName": "Blood-root",
        "latinName": "Sanguinaria canadensis",
        "fileExt": "blood-root",
        "family": "",
        "price": 4.75,
        "description": "One of the first wildflowers to emerge in early spring with delicate, white 1-2 inch flowers with yellow centers that are visited by the first pollinating insects. After bloom, the distinctive large, deeply-lobed foliage adds a distinctive texture to the woodland garden.",
        "native": "Yes",
        "growingConditions": "Full shade in medium soil",
        "height": "12\"",
        "blooms": "In early spring",
        "naturalHabitat": "Rich deciduous woods",
        "seedsPerPacket": "45-50 (moist-stratified)",
        "germination": [
          "E",
          "F"
        ],
        "germNotes": "Sow these seeds immediately upon receipt, outdoors in pots from November through February. This seed has a double dormancy so look for germination the second spring. This species is challenging to grow, and a great species for more experienced seed-sowers.",
        "pairs": "Blue lobelia and red baneberry",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "memekas nehënawlachi",
        "lenapeMeaning": "that on which butterflies alight",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=8913 ",
        "englishName": "Butterfly milkweed",
        "latinName": "Asclepias tuberosa",
        "fileExt": "butterfly-milkweed",
        "family": "",
        "price": 4.75,
        "description": "A summer-blooming wildflower in the milkweed family that is an important host to the monarch butterfly. Mid-summer blooming, orange flower clusters attract many species of butterflies and pollinating insects. Must have sunny, dry soil to thrive. Excellent dry garden plant or naturalized in a dry meadow. Deer-resistant foliage.",
        "native": "Yes, though extinct in the wild. Garden-collected seed.",
        "growingConditions": "Sun in dry soil",
        "height": "18\"",
        "blooms": "In mid-summer",
        "naturalHabitat": "Pine barrens, dry, sandy meadows, and roadsides",
        "pairs": "Smooth blue aster and sundial lupine",
        "seedsPerPacket": "40",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds need a winter or cold period to germinate - a minimum of 30 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots November through February. A great species for beginner seed-sowers.",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "wisaòtaèk",
        "lenapeMeaning": "yellow flower",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=11278",
        "englishName": "Canadian goldenrod",
        "latinName": "Solidago canadensis",
        "fileExt": "canadian-goldenrod",
        "family": "Asteraceae",
        "price": 4.75,
        "description": "Provides vital sources of pollen and nectar for bees and other insects in the late summer and fall throughout North America. Canada goldenrod can be used for revegetation of disturbed areas, for mine spoil reclamation, and soil stabilization.",
        "native": "Yes.",
        "growingConditions": "Full sun",
        "height": "4-5'",
        "blooms": "In late fall",
        "naturalHabitat": "",
        "seedsPerPacket": "50-100",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds need a winter or cold period to germinate - a minimum of 60 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots November through February. A great species for beginner seed-sowers.",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "puhwèsënakw",
        "lenapeMeaning": "pithy tree",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=8913 ",
        "englishName": "Elderberry",
        "latinName": "Sambucus canadensis",
        "fileExt": "elderberry-4",
        "family": "",
        "price": 4.75,
        "description": "Considered a pioneer species and not long-lived, Common Elderberry performs best with low competition from other woody plants and in full sun to light shade. Birds love the fruits and it's a battle of wits to harvest them before the birds get them all, and before the rock-hard seeds become too large. Timed right, it makes great pie, among other things. It blooms much later than the related Red-berried Elder (Sambucus racemosa), which is more common as a woodland understory shrub, has more pyramidal flower clusters, orange-brown pith in 2-year-old branches, and, as the common name suggests, has bright red berries. Its berries are inedible and mature when Common Elderberry is just starting to bloom. Sambucus canadensis is often listed as synonym Sambucus nigra subsp. canadensis, considered by some to be a European counterpart and by others as the accepted name, with S. canadensis the synonym. The debate goes on. There may be several varieties of S. canadensis—information is rather sketchy and, again, there does not appear to be a consensus—but var. canadensis, characterized by hairs on the leaflet veins but not the surface.",
        "otherSource": "https://www.minnesotawildflowers.info/shrub/common-elderberry",
        "native": "Yes.",
        "growingConditions": "",
        "height": "4-13'",
        "blooms": "July-August",
        "naturalHabitat": "part shade, sun; moist; floodplains, wet ditches, thickets, woodland edges, marshland edges, meadows",
        "seedsPerPacket": "50-100",
        "germination": [
          ""
        ],
        "germNotes": "",
        "lenapeDescription": "Nora Thompson Dean recalled that her father made toy squirt guns out of elderberry stems for her and her brothers when they were children. Freddie Washington mentioned that elderberries were employed to make a dye used in coloring basket splints.",
        "informant": "Nora Thompson Dean and Freddie Washington",
        "lenapeDescriptionSource": "Delaware Ethnobotany"
      },
      {
        "lenapeName": "wtehim",
        "lenapeMeaning": "heart fruit",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=11446",
        "englishName": "Wild Strawberry",
        "latinName": "Fragaria virginiana",
        "fileExt": "wild-strawberry",
        "family": "",
        "price": 4.75,
        "description": "Small, white flowers with yellow centers brighten the spring landscape and attract pollinating insects. Low, evergreen tripled-leaved rosettes carpet the ground. In July, lots of juicy red berries cover the plants. Edible to wildlife and people. Makes a great ground cover or meadow plant.",
        "native": "Yes.",
        "growingConditions": "Sun to shade in dry to moist soil",
        "height": "4\"",
        "blooms": "In mid-summer",
        "naturalHabitat": "Meadows, woodland edges, and roadsides with moist to dry, sandy, or gravelly soils",
        "seedsPerPacket": "50-100",
        "germination": [
          "B"
        ],
        "germNotes": "The easiest method for sowing these seeds is to plant them outdoors in pots from November through mid-March. Please note: wild strawberry seeds must have two weeks below 40 degrees F to germinate. If you are sowing the seeds after mid-March (when daytime temperatures may be above 40*), sow seeds in a pot, wrap in a plastic bag, and place in a refrigerator for two weeks before placing outside. A great species for beginner seed-sowers.",
        "lenapeDescription": "The fruit of this plant are used to improve the complexion. The leaves should be crushed and then applied as a face mask.",
        "informant": "Nora Thompson Dean",
        "lenapeDescriptionSource": "Delaware Ethnobotany"
      },
      {
        "lenapeName": "matapipalinko",
        "lenapeMeaning": "that which is never overlooked",
        "lenapeTalkingDict": "https://www.talklenape.org/detail?id=4371",
        "englishName": "Cardinal flower",
        "latinName": "Lobelia cardinalis",
        "fileExt": "cardinal-flower",
        "family": "",
        "price": 4.75,
        "description": "In midsummer, tall spikes of deep red flowers cover the plant and attract hummingbirds and butterflies. A dramatic plant for moist gardens and wet areas in sun or shade. A short-lived perennial that will reseed readily if happy.",
        "native": "Yes.",
        "growingConditions": "Sun to shade in moist to wet soil",
        "height": "2-3'",
        "blooms": "In midsummer",
        "naturalHabitat": "Wetlands and streamsides",
        "seedsPerPacket": "50-100",
        "germination": [
          "B",
          "C"
        ],
        "germNotes": "These seeds require a cold period to germinate - a minimum of 60 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots, on the soil surface and leave uncovered, November through February. A great species for beginner seed-sowers.",
        "pairs": "Boneset and blue iris in sunny areas; ferns in shady areas",
        "lenapeDescription": "Cardinal flower was believed to be a love charm that would help the Delaware win the hand of a lover. It was kept and prayed over so would work its magic charm. The root of this plant is used as a philter or love charm. The root is first cleaned and then touched all over the body. Nora Thompson Dean commented, \"Old ladies use it a love charm. They usually talk to it and offer tobacco to it in secret.\" All ages can use it as a love charm.",
        "informant": "Nora Thompson Dean",
        "lenapeDescriptionSource": "Delaware Ethnobotany"
      },
      {
        "lenapeName": "winkimakwsko",
        "lenapeMeaning": "sweet smelling grass",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=11202",
        "englishName": "Horsemint, or spotted bee-balm",
        "latinName": "Monarda punctata",
        "fileExt": "spotted-bee-balm",
        "family": "Bee-balms",
        "price": 4.75,
        "description": "Blooming in late summer with pale pink, tiered flower clusters and gray-green foliage. This plant makes a dramatic garden display and attracts an interesting array of pollinating insects. Foliage can be used for tea. A biennial species, but will self-sow if happy in its location. Deer-proof.",
        "native": "Native from southern New England south and west to the prairie states.",
        "growingConditions": "Sun to part shade in dry soil",
        "height": "2'",
        "blooms": "In late summer",
        "naturalHabitat": "Dry sandy or gravelly soils of beaches, pine barrens, woodland edges, and roadsides",
        "seedsPerPacket": "50-100",
        "pairs": "Blue-eyed grass, butterfly milkweed, Scotch bellflower, and sundial lupine",
        "germination": [
          "A"
        ],
        "germNotes": "These seeds do not need a winter or cold period to germinate. Sow in pots November through April. A great species for beginner seed-sowers.",
        "lenapeDescription": "The leaves are used as a headache cure. The leaves are crushed and placed in a small pan of cold water . The wet leaves are then placed in a rag and applied on the head as a compress. Note - There were two kinds used, but not Mentha. It should be Monarda.",
        "informant": "Nora Thompson Dean",
        "lenapeDescriptionSource": "Delaware Ethnobotany"
      },
      {
        "lenapeName": "chixamokànatae",
        "lenapeMeaning": "comb-flower",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=870",
        "englishName": "Black-eyed coneflower",
        "latinName": "Rudbeckia hirta",
        "fileExt": "black-eyed-coneflower",
        "family": "",
        "price": 4.75,
        "description": "A bright golden-yellow meadow coneflower with a black center that blooms from mid-summer to fall. It attracts numerous butterflies when in bloom, and birds to its seed heads. Thrives in poor, dry soils. Will bloom the first year from seed; easy to establish in waste areas. A good urban plant for sunny dry locations.",
        "native": "No. Grows wild in Maine but is naturalized from west of New England.",
        "growingConditions": "Sun in dry soil",
        "height": "2'",
        "blooms": "In mid-summer",
        "naturalHabitat": "Dry meadows, roadsides, and disturbed areas",
        "seedsPerPacket": "50-100",
        "germination": [
          "A"
        ],
        "germNotes": "These seeds do not need a winter or cold period to germinate. Sow outdoors in pots November through April. A great species for beginner seed-sowers.",
        "pairs": "Butterfly milkweed and smooth blue aster",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "pitukëna",
        "lenapeTalkingDict": "https://www.talk-lenape.org/detail?id=8811 ",
        "lenapeMeaning": "that which grows double",
        "englishName": "Common milkweed",
        "latinName": "Asclepias syriaca",
        "fileExt": "common-milkweed",
        "family": "",
        "price": 4.75,
        "description": "A fragrant summer-blooming meadow wildflower that is crucial to the life cycle of the monarch butterfly. Pink globe-shaped flower clusters provide nectar for many species of bees and butterflies. Plant spreads by underground runners and is most suited to meadows and roadsides, as it is challenging to control in a garden.",
        "native": "Yes.",
        "growingConditions": "Sun in medium soil",
        "height": "2'",
        "blooms": "In mid-summer",
        "pairs": "New England aster and tall-white aster",
        "naturalHabitat": "Meadows, pastures, and roadsides",
        "seedsPerPacket": "50-100",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds need a winter or cold period to germinate - a minimum of 30-60 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots November through February. A great species for beginner seed-sowers.",
        "lenapeDescription": "Milkweed is gathered in the spring when about one foot tall. At this height it is still tender. Freddie Washington explained that there are four kinds of milkweed, three of which are not fit to eat . The edible sor t blooms in June.",
        "informant": "Freddie Washington",
        "lenapeDescriptionSource": "Delaware Ethnobotany"
      },
      {
        "lenapeName": "anshikëmënshi",
        "lenapeTalkingDict": "https://www.talklenape.org/detail?id=18404",
        "englishName": "Yarrow",
        "latinName": "Achillea millefolium",
        "fileExt": "yarrow2",
        "family": "",
        "price": 4.75,
        "description": "Yarrow has flat-topped or dome-shaped clusters of small white flowers that bloom from April to October. An attractive, hardy perennial, yarrow can reach about 3 feet in height. Its aromatic, fine, feathery-cut leaves give the plant a soft, fern-like appearance. Yarrow attracts butterflies, bees and other insects, making it a nice addition to a pollinator garden. This species can become weedy, however, since it spreads readily and tolerates disturbance.\n        Numerous tribes in North America used yarrow for a variety of ailments. The crushed plant was applied to wounds and burns. The dried leaves were used as a tea to soothe colds, fever, and headache. Yarrow beer has been brewed in Europe since the middle ages. The Chinese considered yarrow plants to be good luck. Even Lewis and Clark were acquainted with yarrow. It was collected during the Lewis and Clark Expedition while they were camped near Kamiah, Idaho in May 1806.",
        "native": "Yes.",
        "growingConditions": "Full sun, or leggier in part-shade.",
        "height": "2-4'",
        "blooms": "",
        "naturalHabitat": "Open grasslands or open forests",
        "seedsPerPacket": "50-100",
        "germination": [
          ""
        ],
        "pairs": "Butterfly milkweed, smooth penstemon, redhot poker lily, columbine.",
        "germNotes": "Plant in spring or early summer after the danger of frost has passed.",
        "otherSource": "USDA, Clemson Home & Garden Information Center",
        "lenapeDescription": "Yarrow tea will stop excess menstrual flow. The roots of the plant are pounded with a stone, after which the macerated roots are boiled to produce the medicinal tea.",
        "informant": "Nora Thompson Dean",
        "lenapeDescriptionSource": "Delaware Ethnobotany"
      },
      {
        "lenapeName": "hatusakàn",
        "lenapeMeaning": "",
        "lenapeTalkingDict": "https://www.talklenape.org/detail?id=1285",
        "englishName": "Ironweed",
        "latinName": "Vernonia noveboracensis",
        "fileExt": "new-york-ironweed",
        "family": "",
        "price": 4.75,
        "description": "Dramatic, large summer-blooming plant excellent for borders, rain gardens, and meadows. Deep purple flowers attract pollinating insects and butterflies. Deer-resistant foliage.",
        "native": "No. Native to the southern New England.",
        "growingConditions": "Sun in medium to wet soil",
        "height": "6-8'",
        "blooms": "In late summer",
        "pairs": "Asters, boneset, and swamp milkweed",
        "naturalHabitat": "Meadows, wetlands, and roadside edges",
        "seedsPerPacket": "50-100",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds need a winter or cold period to germinate - a minimum of 60 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots November through February. A great species for beginner seed-sowers.",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "",
        "lenapeMeaning": "",
        "lenapeTalkingDict": "",
        "englishName": "Northeastern beardtongue",
        "latinName": "Penstemon hirsutus",
        "fileExt": "northeastern-beardtongue",
        "family": "Beardtongues",
        "price": 4.75,
        "description": "Low, dark green foliage with numerous white-to-pale-lavender flowers blooms in early summer attracting pollinating insects and hummingbirds. Must have well drained soil. A short-lived perennial but will reseed if happy. Excellent for stone walls and rock gardens.",
        "native": "Yes",
        "growingConditions": "Sun to part shade in dry to medium soil",
        "height": "16\"",
        "blooms": "In early summer",
        "naturalHabitat": "Dry, rocky woodland edges and meadows, ledges, and disturbed areas",
        "seedsPerPacket": "50-100",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds need a winter or cold period to germinate - a minimum of 60 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots November through February. A great species for beginner seed-sowers.",
        "pairs": "",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "",
        "lenapeMeaning": "",
        "lenapeTalkingDict": "",
        "englishName": "Eastern shooting star",
        "latinName": "Dodecatheon meadia",
        "fileExt": "eastern-shooting-star",
        "family": "",
        "price": 4.75,
        "description": "An early-blooming spring ephemeral with deep pink star-shaped flowers held above a rosette of low green foliage. Flowers attract early pollinators. Deer-resistant. Plants go dormant in late summer.",
        "native": "No. Native south and west of New England.",
        "growingConditions": "Sun to part shade in medium soil",
        "height": "12\"",
        "blooms": "In early spring",
        "naturalHabitat": "Open woodlands and meadows with moist soil",
        "seedsPerPacket": "45-50 (moist-stratified)",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds require a cold period to germinate - a minimum of 21 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots, on the soil surface and leave uncovered, November through February. This species is challenging to grow, and a great species for more experienced seed-sowers.\n          *These seeds have been known to germinate without a cold period, best practice is to allow a minimum of 21 days of cold.",
        "pairs": "Jacob's-ladder and spotted crane's-bill",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "",
        "lenapeMeaning": "",
        "lenapeTalkingDict": "",
        "englishName": "New England aster",
        "latinName": "Symphyotrichum novae-angliae",
        "fileExt": "new-england-aster",
        "family": "Asters",
        "price": 4.75,
        "description": "A fall-blooming meadow aster with bright purple or pink flowers and yellow centers. Dark green foliage can be cut back in mid-summer to control height. Flowers supply abundant nectar for late-season bees and butterflies. Foliage important for many species in their larval stages. Excellent garden and landscape plant with late season interest.",
        "native": "Yes",
        "growingConditions": "Sun to part shade in medium to wet soil",
        "height": "2-5'",
        "blooms": "In late fall",
        "naturalHabitat": "Meadows, roadsides, and ditches with fertile, moist soils",
        "seedsPerPacket": "50-100",
        "germination": [
          "A"
        ],
        "germNotes": "These seeds do not need a winter or cold period to germinate - the rate of germination may be higher if the seeds are exposed to a period of cold, but it is not required. Sow outdoors in pots November through early April. A great species for beginner seed-sowers.",
        "pairs": "",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "",
        "lenapeMeaning": "",
        "lenapeTalkingDict": "",
        "englishName": "Wild bee-balm",
        "latinName": "Monarda fistulosa",
        "fileExt": "wild-bee-balm",
        "family": "Bee-balms",
        "price": 4.75,
        "description": "In mid-summer, distinctive lavender flowers bloom atop fragrant blue-green foliage, attracting butterflies, bees and hummingbirds. Plant is aggressive in a small garden but is a great choice in a bed of its own or in a meadow. Leaves make a pleasant tea.",
        "native": "Yes.",
        "growingConditions": "Sun to part shade in moist to dry soil",
        "height": "4'",
        "blooms": "In mid-summer",
        "naturalHabitat": "Woodlands, edges, meadows, and disturbed areas",
        "seedsPerPacket": "50-100",
        "pairs": "Foxglove beardtongue and Virginia mountain-mint",
        "germination": [
          "A"
        ],
        "germNotes": "These seeds do not need a winter or cold period to germinate. Sow in pots November through April. A great species for beginner seed-sowers.",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      },
      {
        "lenapeName": "",
        "lenapeTalkingDict": "",
        "englishName": "Blue-stem goldenrod",
        "latinName": "Solidago caesia",
        "fileExt": "blue-stem-goldenrod",
        "family": "Asteraceae",
        "price": 4.75,
        "description": "A lovely goldenrod for shady gardens and landscapes. In October, delicate arching stems are covered with tiny yellow flower clusters that attract fall pollinators. A clump-forming species that is very well-behaved and deserving of a place in shady gardens. Deer-proof.",
        "native": "Yes.",
        "growingConditions": "Part sun to shade in dry to medium soil",
        "height": "18\"",
        "blooms": "In late fall",
        "naturalHabitat": "Dry deciduous woodlands and shady edges",
        "seedsPerPacket": "50-100",
        "germination": [
          "B"
        ],
        "germNotes": "These seeds need a winter or cold period to germinate - a minimum of 60 days below 40°F in moist soil (or sand or vermiculite). Sow outdoors in pots November through February. A great species for beginner seed-sowers.",
        "lenapeDescription": "",
        "informant": "",
        "lenapeDescriptionSource": ""
      }
    ]
  }